config/cf/Catalogs/Контексты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Контексты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индивидуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпрятатьКонтекстПриВыбореВДеле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДочерниеКонтексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контексты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Видимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/Контексты/Forms/ДиаглогВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКонтекстов = Новый Массив;
	Если Параметры.Свойство("Контексты", МассивКонтекстов) = Ложь Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Контексты.Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Контекст КАК Контекст,
		|	СУММА(1) КАК Количество,
		|	ЛОЖЬ КАК Флаг
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВложенныйЗапрос.Контекст КАК Контекст
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Контексты.Ссылка КАК Контекст
		|		ИЗ
		|			Справочник.Контексты КАК Контексты
		|		ГДЕ
		|			Контексты.Пользователь = &Пользователь
		|			И Контексты.ПометкаУдаления = ЛОЖЬ
		|			И Контексты.СпрятатьКонтекстПриВыбореВДеле = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			КонтекстыВидимость.Ссылка
		|		ИЗ
		|			Справочник.Контексты.Видимость КАК КонтекстыВидимость
		|		ГДЕ
		|			КонтекстыВидимость.Пользователь = &Пользователь
		|			И КонтекстыВидимость.Ссылка.ПометкаУдаления = ЛОЖЬ
		|			И КонтекстыВидимость.Ссылка.СпрятатьКонтекстПриВыбореВДеле = ЛОЖЬ) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Контекст
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Контекст.Представление";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Контексты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если МассивКонтекстов.Найти(Выборка.Контекст) <> Неопределено Тогда
			НоваяСтрока.Флаг = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Массив = Новый Массив;
	Для Каждого Строки Из Контексты Цикл
		Если Строки.Флаг = Истина Тогда
			Массив.Добавить(Строки.Контекст);
		КонецЕсли;
	КонецЦикла;
	ОповеститьОВыборе(Массив);
	
КонецПроцедуры

#КонецОбласти
